Check first 5 rows or last 5 rows

In [ ]:
import pandas as pd
data_t = pd.read_csv("https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv")
data_t.head(5)

                                            Name PClass  ...  Survived SexCode
0                   Allen, Miss Elisabeth Walton    1st  ...         1       1
1                    Allison, Miss Helen Loraine    1st  ...         0       1
2            Allison, Mr Hudson Joshua Creighton    1st  ...         0       0
3  Allison, Mrs Hudson JC (Bessie Waldo Daniels)    1st  ...         0       1
4                  Allison, Master Hudson Trevor    1st  ...         1       0

[5 rows x 6 columns]

In [ ]:
data_t.tail(5)

                        Name PClass   Age   Sex  Survived  SexCode
1308      Zakarian, Mr Artun    3rd  27.0  male         0        0
1309  Zakarian, Mr Maprieder    3rd  26.0  male         0        0
1310        Zenni, Mr Philip    3rd  22.0  male         0        0
1311        Lievens, Mr Rene    3rd  24.0  male         0        0
1312          Zimmerman, Leo    3rd  29.0  male         0        0

Row: observation
<br>Column: feature

# 3.1 Creating a dataframe

We seldom create data from 0 in real life. We usually use data source...
<br>But should remember how to do this.
<br>1.How to create data by columns:

In [ ]:
data_create = pd.DataFrame()
data_create["id"] = [0,1,2]
data_create["name"] = ["John","Bob","Marry"]
data_create["sex"] = ["M","M","F"]
data_create

   id   name sex
0   0   John   M
1   1    Bob   M
2   2  Marry   F

2.How to append by index:
<br>**Create a series with index, but should ignore it when append.**

In [ ]:
new_student = pd.Series([3,"William","M"],index = ["id","name","sex"])
data_create.append(new_student,ignore_index=True)

   id     name sex
0   0     John   M
1   1      Bob   M
2   2    Marry   F
3   3  William   M

# 3.2 Describing the Data

In [ ]:
data_t.shape

(1313, 6)

In [ ]:
data_t.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

Use iloc to select rows

In [ ]:
data_t.iloc[0:5]

                                            Name PClass  ...  Survived SexCode
0                   Allen, Miss Elisabeth Walton    1st  ...         1       1
1                    Allison, Miss Helen Loraine    1st  ...         0       1
2            Allison, Mr Hudson Joshua Creighton    1st  ...         0       0
3  Allison, Mrs Hudson JC (Bessie Waldo Daniels)    1st  ...         0       1
4                  Allison, Master Hudson Trevor    1st  ...         1       0

[5 rows x 6 columns]

Use loc to select rows after setting the string index
<br>Should **set value to data_t again**, or key error shows up.
<br>Without setting index, these results have the type of Dataframe.

In [ ]:
#use loc directly
data_t.loc[data_t['Name']=='Allen, Miss Elisabeth Walton']

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1

In [ ]:
data_t[data_t['Name']=='Allen, Miss Elisabeth Walton']

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1

The result blow has the type of series.

In [ ]:
#set index first
data_t = data_t.set_index(data_t["Name"])
data_t.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

# 3.4 Selecting Rows Based on Conditionals

Use "&" rather than "and" or "&&", cannot omit the second "()"

In [ ]:
data_t[(data_t['Age'] >=30) & (data_t['Age'] <=60)].head(5)

                                                                                      Name  ... SexCode
Name                                                                                        ...
Allison, Mr Hudson Joshua Creighton                    Allison, Mr Hudson Joshua Creighton  ...       0
Anderson, Mr Harry                                                      Anderson, Mr Harry  ...       0
Andrews, Mr Thomas, jr                                              Andrews, Mr Thomas, jr  ...       0
Appleton, Mrs Edward Dale (Charlotte Lamson)  Appleton, Mrs Edward Dale (Charlotte Lamson)  ...       1
Astor, Colonel John Jacob                                        Astor, Colonel John Jacob  ...       0

[5 rows x 6 columns]

# 3.5 Replacing Values

In [ ]:
data_t_r = data_t['Sex'].replace(["female","male"], ["Woman","Man"])
data_t_r.head(5)

Name
Allen, Miss Elisabeth Walton                     Woman
Allison, Miss Helen Loraine                      Woman
Allison, Mr Hudson Joshua Creighton                Man
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    Woman
Allison, Master Hudson Trevor                      Man
Name: Sex, dtype: object

It won't replace the **original dataframe** here.

In [ ]:
data_t.head(5)

                                                                                        Name  ... SexCode
Name                                                                                          ...
Allen, Miss Elisabeth Walton                                    Allen, Miss Elisabeth Walton  ...       1
Allison, Miss Helen Loraine                                      Allison, Miss Helen Loraine  ...       1
Allison, Mr Hudson Joshua Creighton                      Allison, Mr Hudson Joshua Creighton  ...       0
Allison, Mrs Hudson JC (Bessie Waldo Daniels)  Allison, Mrs Hudson JC (Bessie Waldo Daniels)  ...       1
Allison, Master Hudson Trevor                                  Allison, Master Hudson Trevor  ...       0

[5 rows x 6 columns]

Replace all values in dataframe is avaliable.

In [ ]:
data_t.replace(1,"One").head(5)

                                                                                        Name  ... SexCode
Name                                                                                          ...
Allen, Miss Elisabeth Walton                                    Allen, Miss Elisabeth Walton  ...     One
Allison, Miss Helen Loraine                                      Allison, Miss Helen Loraine  ...     One
Allison, Mr Hudson Joshua Creighton                      Allison, Mr Hudson Joshua Creighton  ...       0
Allison, Mrs Hudson JC (Bessie Waldo Daniels)  Allison, Mrs Hudson JC (Bessie Waldo Daniels)  ...     One
Allison, Master Hudson Trevor                                  Allison, Master Hudson Trevor  ...       0

[5 rows x 6 columns]

It won't replace the **original dataframe** here. either.

In [ ]:
data_t.head(5)

                                                                                        Name  ... SexCode
Name                                                                                          ...
Allen, Miss Elisabeth Walton                                    Allen, Miss Elisabeth Walton  ...       1
Allison, Miss Helen Loraine                                      Allison, Miss Helen Loraine  ...       1
Allison, Mr Hudson Joshua Creighton                      Allison, Mr Hudson Joshua Creighton  ...       0
Allison, Mrs Hudson JC (Bessie Waldo Daniels)  Allison, Mrs Hudson JC (Bessie Waldo Daniels)  ...       1
Allison, Master Hudson Trevor                                  Allison, Master Hudson Trevor  ...       0

[5 rows x 6 columns]

TODO:
<br>[Reference0](https://docs.python.org/3/library/re.html)
<br>[Reference1](https://www.w3schools.com/python/python_regex.asp)

In [ ]:
data_t.replace(r"^1.*st$", "First", regex=True).head(5)

                                                                                        Name  ... SexCode
Name                                                                                          ...
Allen, Miss Elisabeth Walton                                    Allen, Miss Elisabeth Walton  ...       1
Allison, Miss Helen Loraine                                      Allison, Miss Helen Loraine  ...       1
Allison, Mr Hudson Joshua Creighton                      Allison, Mr Hudson Joshua Creighton  ...       0
Allison, Mrs Hudson JC (Bessie Waldo Daniels)  Allison, Mrs Hudson JC (Bessie Waldo Daniels)  ...       1
Allison, Master Hudson Trevor                                  Allison, Master Hudson Trevor  ...       0

[5 rows x 6 columns]

# 3.6 Renaming Columns

Create a dictionary to change the columns name.

In [ ]:
data_t.rename(columns={'PClass': 'Passenger Class', 'Sex': 'Gender'}).head(5)

                                                                                        Name  ... SexCode
Name                                                                                          ...
Allen, Miss Elisabeth Walton                                    Allen, Miss Elisabeth Walton  ...       1
Allison, Miss Helen Loraine                                      Allison, Miss Helen Loraine  ...       1
Allison, Mr Hudson Joshua Creighton                      Allison, Mr Hudson Joshua Creighton  ...       0
Allison, Mrs Hudson JC (Bessie Waldo Daniels)  Allison, Mrs Hudson JC (Bessie Waldo Daniels)  ...       1
Allison, Master Hudson Trevor                                  Allison, Master Hudson Trevor  ...       0

[5 rows x 6 columns]

It won't replace the **original dataframe** here. either.

In [ ]:
data_t.head(5)

                                                                                        Name  ... SexCode
Name                                                                                          ...
Allen, Miss Elisabeth Walton                                    Allen, Miss Elisabeth Walton  ...       1
Allison, Miss Helen Loraine                                      Allison, Miss Helen Loraine  ...       1
Allison, Mr Hudson Joshua Creighton                      Allison, Mr Hudson Joshua Creighton  ...       0
Allison, Mrs Hudson JC (Bessie Waldo Daniels)  Allison, Mrs Hudson JC (Bessie Waldo Daniels)  ...       1
Allison, Master Hudson Trevor                                  Allison, Master Hudson Trevor  ...       0

[5 rows x 6 columns]

# 3.7 Finding the Minimum, Maximum, Sum, Average, and Count

Actually in diecribe() we could see some of the statistic features, could use directly.
<br> If we want to calculate one specific value, we should use functions below.

In [ ]:
data_t.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

.count(): **Count non-NA cells for each column or row.**([Reference](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.count.html))

In [ ]:
print(data_t["Age"].min(),data_t["Age"].max(),data_t["Age"].sum(),data_t["Age"].mean(),data_t["Age"].count())

0.17 71.0 22980.88 30.397989417989415 756

# 3.8 Finding Unique Values

In [ ]:
data_t["Sex"].unique()

array(['female', 'male'], dtype=object)

Count unique values.
<br>In PClass there is abnormal data shows "*".

In [ ]:
data_t["PClass"].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

If only want how many unique values, use nunique.

In [ ]:
data_t["PClass"].nunique()

4